// 通用数据文件
const commonData = {
    // 警告框数据
    warningInfo: {
        warningText: "******非拉勿偷，偷必删+全网拉黑******",
        noticeItems: [
            "1. 进群新人请先改昵称为 🆔+游戏昵称，例：🆔小红狐。",
            "2. 新增删除请@小红狐。",
            "3. 如果好友许久未通过，请在群内艾特对应的农场主。"
        ]
    },
    
    // 更新日志
    updates: [
        { date: "2024.3.17", content: "备忘录更新。" },
        { date: "2024.3.20", content: "添加商人信息。" },
        { date: "2024.3.21", content: "设计更好看的ui样式。" }
    ],
    
    // 攻略数据
    guides: [
        {
            title: "温泉攻略",
            tips: [
                "温泉经验只与自己的温泉等级有关。",
                "获取喝茶buff需要泡温泉，坐进去然后喝茶。",
                "每周温泉喝茶buff刷新时间为周一早上8点。",
                "没有60级的星宝是不能泡温泉和获取喝茶buff的哦。",
                "喝茶的buff只能持续24小时。",
                "早上8点后可以重新泡温泉获取经验。",
                "温泉buff只能同时存在一个，上一个时间没到，强行喝茶会提示你是否替换当前效果。"
            ]
        },
        {
            title: "吞吞花攻略",
            tips: [
                "种植时间：周二晚上9点10-30到周五晚上9点后成熟",
                "周五晚上九点10-30分到周日晚上9点后",
                "这样每周可以吃两次双倍。",
                "成熟期吞噬：普通吃一波。祈愿金色吃一波，再金色变彩色吃一波，菜熟一次可以让吞吞花吃三波收益。",
                "周一晚上9点成熟后，收取后不种吞吞花，卡波16/32小时的植物。到周二晚上九点10-30再种吞吞花。周而复始。",
                "晚上9点10-30分（小号给吞花祈愿时间）",
                "注意：吞吞花成熟后就吞不了了，所以要在成熟前菜先成熟祈愿收取。"
            ]
        }
    ]
}; 