// 通用数据文件
const commonData = {
    // 警告框数据
    warningInfo: {
        warningText: "******非拉勿偷，偷必删+全网拉黑******",
        noticeItems: [
            "1. 进群新人请先改昵称为 🆔+游戏昵称，例：🆔小红狐。",
            "2. 新增删除请@小红狐。",
            "3. 如果好友许久未通过，请在群内@对应昵称的农场主。"
        ]
    },
    
    // 更新日志
    updates: [
        { date: "2024.3.17", content: "备忘录更新。" },
        { date: "2024.3.20", content: "添加商人信息。" },
        { date: "2024.3.21", content: "设计更好看的ui样式。" },
        { date: "2024.3.22", content: "新增双倍商人售价对比。" }
    ],
}; 